tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "bash"
brew "coreutils"
brew "git"
brew "git-extras"
brew "gnupg2"
brew "imagemagick"
brew "irssi"
brew "mackup"
brew "mas"
brew "parquet-tools"
brew "pinentry-mac"
brew "pkg-config"
brew "python"
brew "python@2"
brew "sqlite"
brew "tmux"
brew "trash"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"

cask_args appdir: "/Applications"
cask "1password"
cask "anki"
cask "appcleaner"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "mactex-no-gui"
cask "plex-media-server"
cask "polar-bookshelf"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code-insiders"
cask "vivaldi"
cask "vlc"
cask "whatsapp"
cask "xld"

mas "SnippetsLab", id: 1006087419
mas "Todoist", id: 585829637
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

cask "font-meslo-for-powerline"
