tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "bash"
brew "coreutils"
brew "git"
brew "git-extras"
brew "gnupg2"
brew "mackup"
brew "mas"
brew "pinentry-mac"
brew "pkg-config"
brew "python@2"
brew "python"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "zsh"
brew "zsh-completions"

cask_args appdir: "/Applications"
cask "1password"
cask "appcleaner"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code-insiders"
cask "vlc"
cask "xld"

mas "SnippetsLab", id: 1006087419
mas "Magnet", id: 441258766
mas "Trello", id: 1278508951

cask "font-meslo-for-powerline"
